app/controllers/camps_controller.rb

SELECT "camps".* FROM "camps"
---
  def index
    @camps = Camp.all

SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @camp = Camp.find params[:id]

INSERT INTO "camps" ("name", "subtitle", "contact_name", "contact_email", "contact_phone", "description", "electricity", "light", "fire", "noise", "nature", "moop", "plan", "cocreation", "neighbors", "budgetplan", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @camp = Camp.new(camp_params)
    @camp.creator = current_user

    if @camp.save

SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "grants" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["grants", 6], ["updated_at", "2016-04-14 15:22:55.422705"], ["id", 1]]
UPDATE "camps" SET "grants_received" = ? WHERE "camps"."id" = ?  [["grants_received", 2], ["id", 1]]
---
  def update_grants
    @camp = Camp.find(params[:id])

    # Reduce the number of grants assigned to the current user by the number
    # of grants given away. Increase the number of grants assigned to the
    # camp by the same number of grants.

    # Decrement user grants.
    granted = params['grants'].to_i
    current_user.grants -= granted

    # Increase camp grants.
    @camp.grants_received += granted

    unless current_user.save
      flash[:notice] = "Errors: #{current_user.errors.full_messages.join(', ')}"
      redirect_to camp_path(@camp) and return
    end

    unless @camp.save

SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "camps" SET "contact_phone" = ?, "description" = ?, "electricity" = ?, "light" = ?, "fire" = ?, "noise" = ?, "nature" = ?, "moop" = ?, "plan" = ?, "cocreation" = ?, "neighbors" = ?, "minbudget" = ?, "maxbudget" = ?, "budgetplan" = ? WHERE "camps"."id" = ?
---
  def update
    @camp = Camp.find(params[:id])

    if @camp.update_attributes camp_params

SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @camp = Camp.find(params[:id])