app/controllers/images_controller.rb

  def index
    @images = Image.where camp_id: @camp_id
---
SELECT "images".* FROM "images" WHERE "images"."camp_id" = ?  [["camp_id", 1]]